src/cf/Reports/КнигаУчетаДоходовИРасходовПатент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>КнигаУчетаДоходовИРасходовПатент</Name>
			<Comment>Книга учета доходов и расходов (патент)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/cf/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>(Общ) Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>(Регл) Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>(Регл) Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>(Общ) Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>(Общ) Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>(Общ) Валюта, в которой хранятся денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Comment>(Регл) Номер и дата разрешения открытия счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>(Общ) Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>(Общ) Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>(Общ) Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>(Общ) Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Reports/КнигаУчетаДоходовИРасходовПатент/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

Процедура ПечатьТитульногоЛиста(ДокументРезультат)

	ДокументРезультат.Очистить();
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовИРасходов_ТитульныйЛист";
	
    Секция = ПолучитьМакет("ТитульныйЛист_154н");
	
	Сведения = КонтактнаяИнформацияСервер.СведенияОЮрФизЛице(Организация,,);
	
	Секция.Параметры.НаПериод         = "на " + Формат(Год(ДатаКон), "ЧГ=") + " год";
	Секция.Параметры.ПолноеНаименованиеОрганизации = ПечатныеФормыСервер.ОписаниеОрганизации(Сведения, "НаименованиеДляПечатныхФорм");;
	Секция.Параметры.КодОКПО          = Сведения.КодПоОКПО;
			
	//Соберем банковские счета
	Счета = "";
	
	ЗапросБС = Новый Запрос;
	ЗапросБС.УстановитьПараметр("Владелец", Организация);
	ЗапросБС.УстановитьПараметр("НачДата", НачалоМесяца(ДатаНач));
	ЗапросБС.УстановитьПараметр("КонДата", КонецМесяца(ДатаКон));
	ЗапросБС.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	ЗапросБС.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.НомерСчета КАК Номер,
	|	БанковскиеСчета.Банк.Наименование КАК Банк
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец
	|	И (БанковскиеСчета.ДатаОткрытия = &ПустаяДата ИЛИ БанковскиеСчета.ДатаОткрытия <= &КонДата)
	|	И (БанковскиеСчета.ДатаЗакрытия = &ПустаяДата ИЛИ БанковскиеСчета.ДатаОткрытия >= &НачДата)";
	
	
	БанковскиеСчета = ЗапросБС.Выполнить().Выгрузить();
	Для Каждого Строка Из БанковскиеСчета Цикл
		НомСч = СокрЛП(Строка.Номер);
		Банк  = СокрЛП(Строка.Банк);
		Счета = Счета+"№ "+НомСч+" в "+Банк+", ";
	КонецЦикла;	                         
	Счета = Лев(Счета,СтрДлина(Счета)-2);
	Секция.Параметры.Счета            = Счета;
		
	
	СтрокаАдреса = СокрЛП(Сведения.ФактическийАдрес);
	Секция.Параметры.АдресОрганизации = Сведения.ФактическийАдрес;
	Секция.Параметры.СрокПатента = "с " + Формат(НачалоМесяца(ДатаНач), "ДФ=""дд ММММ гггг 'г.'""") + " по " + Формат(КонецМесяца(ДатаКон), "ДФ=""дд ММММ гггг 'г.'""");	
	ДокументРезультат.Вывести(Секция);
	
			
		ИНН = Сведения.ИНН;
		
		Если СтрДлина(ИНН) <> 12 Тогда
			// Налогоплательщик - юр. лицо		
			ИНН = "00" + ИНН;		
		КонецЕсли;
		
		Ном = 1;
		Пока Ном > 0 Цикл
			ИмяОбластиИНН = "ПрИНН";
			Если НЕ(Ном > 12) Тогда
				ДокументРезультат.Область(ИмяОбластиИНН + Ном).Текст = ?(Число(ИНН) > 0, Сред(ИНН, Ном, 1), ""); 
				
				Ном = Ном + 1;
				Продолжить;
			КонецЕсли;
			Ном = 0;
		КонецЦикла;
	
	ДокументРезультат.ТолькоПросмотр = Истина;

КонецПроцедуры

Процедура ПечатьРаздела1(ДокументРезультат)
	
	ДокументРезультат.Очистить();
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовИРасходовПатент_Раздел1";
	Макет = ПолучитьМакет("Раздел1_154н");
	
	Секция = Макет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Секция);
	
	ВсегоДоходов = 0;
	НПП = 1;
	ЗапросДР = Новый Запрос;
	ЗапросДР.УстановитьПараметр("НачДата", НачалоМесяца(ДатаНач));
	ЗапросДР.УстановитьПараметр("КонДата", КонецМесяца(ДатаКон));
	ЗапросДР.УстановитьПараметр("Организация", Организация);
	ЗапросДР.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходов КАК КнигаУчетаДоходовИРасходов
	|ГДЕ
	|	КнигаУчетаДоходовИРасходов.Организация = &Организация
	|	И КнигаУчетаДоходовИРасходов.Активность
	|	И КнигаУчетаДоходовИРасходов.Период МЕЖДУ &НачДата И &КонДата";
	
	ВыборкаЗаписей = ЗапросДР.Выполнить().Выбрать();
	Пока ВыборкаЗаписей.Следующий() Цикл
		Если ВыборкаЗаписей.Патент = 0 Тогда Продолжить; КонецЕсли;

		Секция=Макет.ПолучитьОбласть("Строка");
		Секция.Параметры.НомерПП = НПП;
		Секция.Параметры.ТекРасшифровка= ВыборкаЗаписей.Регистратор;
		Секция.Параметры.ПечДатаНомерДок = ВыборкаЗаписей.Графа2;
		Секция.Параметры.ПечСодержОпер = ВыборкаЗаписей.Содержание;
		Секция.Параметры.ПечДоходыБУ = ВыборкаЗаписей.Патент;
		
		ВсегоДоходов = ВсегоДоходов + ВыборкаЗаписей.Патент;
						
		ДокументРезультат.Вывести(Секция);
									
		НПП = НПП + 1;		
	КонецЦикла;
		
	// Выведем подвал
	Секция = Макет.ПолучитьОбласть("Итого");
	Секция.Параметры.ПечДоходыБУ = ВсегоДоходов;
		
	ДокументРезультат.Вывести(Секция);
		
	ДокументРезультат.ТолькоПросмотр = Истина;
	ДокументРезультат.ПовторятьПриПечатиСтроки = ДокументРезультат.Область(6,,6,);
	
КонецПроцедуры

Процедура СформироватьОтчет(ТитульныйЛист, Раздел1) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Не указана организация!");
		Возврат;
	КонецЕсли;
		
	ПечатьТитульногоЛиста(ТитульныйЛист);
	ПечатьРаздела1(Раздел1);
	
КонецПроцедуры

НП = Новый НастройкаПериода;

#КонецЕсли
